src/main/test/artillery/user/delete_csv_users.yaml
config:
  target: '{{ $env.SERVER_URI }}'
  plugins:
    expect: { }
    metrics-by-endpoint: { }
  phases:
    - name: simple_get
      duration: 25
      arrivalRate: 1
  payload:
    path: ../data/random_users.csv
    order: sequence
    skipHeader: true
    delimiter: ","
    skipEmptyLines: true
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId={{ userId }}&pwd={{ pwd }}"
      - log: "Login successful, proceeding to fetch user data."
      - delete:
          url: /users/{{ userId }}
          expect:
            - statusCode: 200