src/main/test/artillery/user/first_get.yaml
config:
  target: '{{ $env.SERVER_URI }}'
  plugins:
    expect: { }
    metrics-by-endpoint: { }
  phases:
    - name: simple_get
      duration: 1
      arrivalRate: 1

scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /users/login
          headers:
            Content-Type: application/x-www-form-urlencoded
          body: "userId=user1&pwd=Pwd123!@#"
          expect:
            - statusCode: 200
      - log: "Starting to fetch user data."
      - get:
          url: /users/user1
          expect:
            - statusCode: 200

after:
  flow:
    - log: "user login"
    - post:
        url: /users/login
        headers:
          Content-Type: application/x-www-form-urlencoded
        body: "userId=user1&pwd=Pwd123!@#"
        expect:
          - statusCode: 200
    - delete:
        url: /users/user1
        expect:
          - statusCode: 200
    - log: "User data deleted."