src/main/test/artillery/user/search_csv_users.yaml
config:
  target: '{{ $env.SERVER_URI }}'
  plugins:
    expect: { }
    metrics-by-endpoint: { }
  phases:
    - name: simple_get
      duration: 1 # How long the test will run for, in seconds
      arrivalRate: 1 # Number of arrivals per second
scenarios:
  - name: TuKanoHome
    flow:
      - get: # This is to fetch user data after login
          url: /users?query=user1 # Ensure the URL is correct
          capture:
            - json: '$'
              as: response
          expect:
            - statusCode: 200 # Check if the response status code is 200
            - contentType: json
            - equals:
                - '11'
                - '{{ response.length }}'